"""
Суть задачи та же, что и Caesar cipher, с одним отличием: кодируются символы из интервала 1F600—1F64F таблицы символов Юникода.
Используется кодировка UTF-8.

Для всех символов сдвиг один и тот же. Сдвиг циклический, т.е. если к последнему символу алфавита применить единичный сдвиг,
то он заменится на первый символ, и наоборот. Напишите программу, которая шифрует текст шифром Цезаря.

Формат ввода:
На первой строке указывается используемый сдвиг шифрования: целое число. Положительное число соответствует сдвигу вправо.
На второй строке указывается непустая фраза для шифрования.

Формат вывода:
Единственная строка, в которой записана фраза: Result: "..." , где вместо многоточия внутри кавычек записана зашифрованная
последовательность.
"""

shift = int(input())
source_string = input().strip()

print('Result: "', end='')
start, end = 0x1F600, 0x1F64F

for letter in source_string:
    position = ord(letter)
    new_position = start + (ord(letter) - start + shift) % (end - start + 1)
    print(chr(new_position), end='')

print('"', end='')