"""
Напишите функцию modify_list(l), которая принимает на вход список целых чисел, удаляет из него все нечётные значения,
а чётные нацело делит на два. Функция не должна ничего возвращать, требуется только изменение переданного списка, например:
"""


def modify_list(l):
    lst = ["*" if (num % 2 != 0) else (num // 2) for num in l]
    lst = [num for num in lst if num != "*"]
    l[:] = lst


lst = [1, 2, 3, 4, 5, 6]
modify_list(lst)
print(lst)
