"""
Напишите функцию, которая для заданного натурального числа n генерирует последовательность чисел, описанную в гипотезе Коллатца:
Если n четное, то делим его пополам, если нечётное, то умножаем на 3 и прибавляем 1.
С итогом вычисления снова проделываем эту операцию до тех пор, пока в результате не будет получено число 1.
"""

num = int(input())
print(num, end=" ")

while num != 1:
    if num % 2 == 0:
        num = num // 2
    else:
        num = num * 3 + 1
    print(num, end=" ")