"""
На вход алгоритму подаётся строка, содержащая цифры и символы латинского алфавита. Эта строка разбивается на так
называемые "серии", которые кодируются парой число-символ или просто символ (в таком случае число считается равным единице).
Результат должен содержать эти серии в том же порядке, что они и встречаются в исходной строке,
при этом каждая серия раскрывается в последовательность символов соответствующей длины.

Например, рассмотрим строку

3ab4c2CaB
Разобъём её на серии
3a b 4c 2C a B
После чего преобразуем серии и получим исходную закодированную строку:
aaabccccCCaB

Формат ввода:
Одна строка, содержащая закодированную последовательность.

Формат вывода:
Строка, содержащая раскодированную последовательность.
"""

input_string = input()
string_number = ""
repeat_number = 1

for ch in input_string:

    if ch.isdigit():
        string_number += ch
        continue

    if string_number != '':
        repeat_number = int(string_number)
        print(ch * repeat_number, end='')
        string_number = ""
    else:
        print(ch, end='')
