"""
На вход алгоритму подаётся строка, содержащая символы латинского алфавита.
Эта строка разбивается на группы одинаковых символов, идущих подряд ("серии").
Каждая серия характеризуется повторяющимся символом и количеством повторений.
Именно эта информация и записывается в код: сначала пишется длина серии повторяющихся символов, затем сам символ.
У серий длиной в один символ количество повторений будем опускать.
"""

import re

line = input()
groups = [m.group(0) for m in re.finditer("(.)\\1*", line)]
result = ""

for group in groups:
    if len(group)>1:
        result += str(len(group)) + group[0]
    else:
        result += group[0]

print(result)
